In [2]:
import pandas as pd
col_names=['sl_no','age','gender','role','id']
data=pd.read_table("../files/ex.txt",sep="|",names=col_names)
data.dtypes

sl_no       int64
age       float64
gender     object
role       object
id         object
dtype: object

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sl_no   943 non-null    int64
 1   age     941 non-null    float64
 2   gender  943 non-null    object
 3   role    943 non-null    object
 4   id      943 non-null    object
dtypes: float64(1), int64(1), object(3)
memory usage: 37.0+ KB

#### Data type can be specified while loading data

#### id is object(string) so replacing any non digit with 3 and converting to float

In [23]:
data1= pd.read_table("../files/ex.txt", sep='|', names= col_names, dtype={'age':float, 'sl_no':float})
data1.head()

   sl_no   age gender        role     id
0    1.0  24.0      M  technician  85711
1    2.0   NaN      F       other  94043
2    3.0   NaN      M      writer  32067
3    4.0  24.0      M  technician  43537
4    5.0  33.0      F       other  15213

In [24]:
# data.id= data.id.str.replace('\D','3')
data.id.head()

0    85711
1    94043
2    32067
3    43537
4    15213
Name: id, dtype: object

In [26]:
# data.id= data.id.astype(float)
data.dtypes

sl_no       int64
age       float64
gender     object
role       object
id         object
dtype: object

In [ ]:
data.describe